#+TODO: TODO | DONE N/A WIP
* [[elisp:(org-projectile-open-project%20"blog")][blog]] [0/1]
  :PROPERTIES:
  :CATEGORY: blog
  :END:
** Posts
*** DONE write 2018 review
    CLOSED: [2019-01-02 Wed] SCHEDULED: <2019-01-02 Wed>
*** signature aggregation schemas (Threshold, Ring)            :cryptography:
*** DONE open source Actihunt
    CLOSED: [2019-02-14 Thu] SCHEDULED: <2019-02-14 Thu>
*** DONE deribit-api-ruby library
    CLOSED: [2019-05-03 Fri 20:10]
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 17:10]--[2019-05-03 Fri 20:10] =>  3:00
    :END:
*** DONE bitmex-api-ruby library
    CLOSED: [2019-02-02 Sat] SCHEDULED: <2019-02-02 Sat>
*** DONE organize projects with org-mode/agenda/journal
    SCHEDULED: <2020-08-11 Tue>
    - TODO file per project
    - agenda: dashboard with tasks/projects
    - journal: daily tasks
*** DONE Homomorphic commitments: Pedersen vs. ElGamal
    SCHEDULED: <2020-02-25 Tue>
*** Schnorr vs. Threshold signature aggregations               :cryptography:
*** literate blogging with Orgmode                       :productivity:emacs:
    - evaluate block inline
    - counting lines
    - pass results between blocks
    - edit block's content in native buffer
    - exporting to multiple formats
*** DONE Week/Day close tradingview indicator
    CLOSED: [2019-02-28 Thu] SCHEDULED: <2019-02-28 Thu>
*** cryptographic trap-doors                                   :cryptography:
*** MPC, FHE, FE                                            :cryptography:
    - multi party computation, homomorphic/functional encryption
    - https://www.esat.kuleuven.be/cosic/blog/the-three-musketeers-of-secure-computation-mpc-fhe-and-fe/
*** DONE zero-knowledge proofs
    CLOSED: [2019-08-29 Thu 17:16]
*** DONE RSA encryption scheme
    CLOSED: [2019-03-18 Mon] SCHEDULED: <2019-03-15 Fri>
*** personal finance with Ledger                               :productivity:
*** DONE ElGamal encryption scheme
    CLOSED: [2019-03-27 Wed 15:18] SCHEDULED: <2019-03-26 Tue>
   :LOGBOOK:
   CLOCK: [2019-03-27 Wed 11:14]--[2019-03-27 Wed 15:17] => 4:03
   :END:
*** NTRU lattice-based encryption scheme                       :cryptography:
    :PROPERTIES:
    :ID:       750DD774-7C04-45F2-90BF-5FE3FFB4E26E
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 11:49]--[2019-05-03 Fri 15:09] =>  3:20
    CLOCK: [2019-05-02 Thu 10:12]--[2019-05-02 Thu 18:04] =>  7:52
    :END:
*** DONE from Jekyll to Hugo
    CLOSED: [2019-04-19 Fri 14:50]
    :LOGBOOK:
    CLOCK: [2019-04-19 Fri 14:07]--[2019-04-19 Fri 14:50] =>  0:43
    :END:
*** DONE ECDSA signature scheme
    CLOSED: [2019-04-09 Tue 17:12]
    :LOGBOOK:
    CLOCK: [2019-04-09 Tue 11:37]--[2019-04-09 Tue 17:12] =>  5:35
    CLOCK: [2019-04-07 Sun 07:48]--[2019-04-07 Sun 18:45] => 10:57
    :END:
*** DONE slices of Bitcoin indicator
    CLOSED: [2019-05-31 Fri 16:20]
*** DONE Schnorr signatures
    CLOSED: [2019-06-27 Thu 10:56]
*** DONE Arch linux
    CLOSED: [2019-07-16 Tue 21:13]
*** DONE package management with Pacman, Rua, Stow
    CLOSED: [2019-09-10 Tue 16:09]
    :LOGBOOK:
    CLOCK: [2019-09-10 Tue 11:30]--[2019-09-10 Tue 16:09] =>  4:39
    :END:
*** DONE password management with Bitwarden
    CLOSED: [2019-08-13 Tue 10:55]
*** DONE configuration management with Mackup and Etckeeper
    CLOSED: [2019-10-22 Tue 14:55]
*** DONE 3DP project
    CLOSED: [2019-07-23 Tue 16:40]
*** understanding GnuPG                                               :linux:
*** DONE in-file navigation in Emacs
    CLOSED: [2019-11-08 Fri 22:56]
     - with both avy and evil, use demo-it for presentation
     - jumps to word, line (with folded paragraphs), timer with avy
     - goto top/middle/bottom of the page
     - goto prev/next edit
     - scroll (cursor remains on the same line, screen moves) horizontal/veritical by chars, lines, pages
     - move (cursor moves to new lines, screen remains) horizontal/veritical by char, line, pages, screens
*** DONE file/window navigation in Emacs
     - find files, buffers
     - find in current buffer, all open buffers, project, files
     - frames/windows
*** advanced IDE-like Emacs                                           :emacs:
     - goto prev/next edit
     - go back/forward
     - goto variable, function, declaration, import/include
     - open/tooltip documentation
     - auto completion
     - file at point
*** DONE protect your digital life
    SCHEDULED: [2020-03-10 Tue]
    - disk encryption
    - multiple laptops / phones
    - data in sync on all devices
    - keep very critical stuff online (albums, important papers) as well for redundancy
    - passwords manager with 3 layer protection: pass, 2FA, ?
    - 2FA in sync on a few devices only
*** FLASC trading strategy                                          :trading:
*** DONE elliptic curves
    CLOSED: [2019-10-01 Tue 17:38]
*** finite fields with graphs                                  :cryptography:
    - https://medium.com/loopring-protocol/learning-cryptography-finite-fields-ced3574a53fe
*** DONE leaving Apple/Googlle and /e/
    CLOSED: [2019-10-09 Wed 14:40]
*** disk encryption/block ciphers                                     :linux:
    - stacked filesystem vs. block device
    - block ciphers: e.g. aes-xts-plain
    - mode of operation: ECB, CBC, XTS https://en.wikipedia.org/wiki/Disk_encryption_theory
*** DONE surviving Bali
    CLOSED: [2019-11-19 Tue 18:33]
*** DONE Month breaks trading indicator
*** DONE SegWit address derivation
*** DONE backpacking Vietnam
*** DONE diving Philippines
*** whales hour indicator                                           :trading:
*** session breaks indicator                                        :trading:
*** WIP a blog post for each cryptography book/chapter         :cryptography:
    - An overview of cryptography - 2020
    - Practical cryptography for developers - 2018
    - Crypto 101 - 2017
    - Serious cryptography - 2018
    - Understanding cryptography - 2010
    - Handbook of applied cryptography - 2001
    - Cryptography theory and practice - 1995
    - A security site
*** DONE hash functions
    SCHEDULED: <2020-09-15 Thu>
    - [X] an overview of cryptography
    - [X] practical cryptography
    - [X] understanding cryptography *
    - [x] handbook of applied cryptography
    - [ ] cryptography theory and practice

*** WIP linux kernel module
    - [X] communication between Hello and World modules
    - [X] configure module via ioctl
    - [ ] calling from kernel space from another module (split #1 post)
    - [ ] calling from user space space via syscall
*** demo the demo-it in Emacs                                         :emacs:
*** DONE COVID-19 indicators
*** CTFs and cryptography attacks                              :cryptography:
    - https://github.com/JohnHammond/ctf-katana/blob/master/README.md
    - https://asecuritysite.com/challenges/
*** DONE travel map coverage
*** earn decentralized income                              :decentralization:
    - earn BAT by seeing ads with Brave
    - earn BTC by map contribution with OsmAnd
    - earn STEEM for articles with SteemIt
    - earn DAI by lending via DyDx (yield farming)
    - earn FIL by storage via Filecoin?
    - mining - PoW
    - staking - PoS
*** DONE draw math functions
    - 1
    - x
    - 2 * x, 2 + x
    - x / 2, x - 2
    - x ^ c, c ^ x
    - log x
    - x * log x
*** DONE high-end Maldives
*** DONE outpost vs. hanoi coworking vs. el nido
*** WIP review Market Wizards books
    - [X] hedge fund market wizards
    - [ ] new market wizards
    - [ ] market wizards
*** DONE generate monero address
*** DONE first US visit in 2000
    SCHEDULED: <2020-09-25 Fri>
*** DONE generate ethereum address                                     :coin:
*** synthetics options                                              :trading:
    - https://www.theoptionsguide.com/synthetic-position.aspx
*** TODO harvest arbitrage
** Fixes
*** DONE add Euler's method to RSA
*** DONE add tags to all posts
    CLOSED: [2019-08-13 Tue 13:19]
*** DONE use session for Python src blocks
    CLOSED: [2019-03-26 Tue]
*** use naming conventions: p - prime, m - message, c - cipher, t - trapdoor
*** use latex formulas
*** links with ' sign
*** use org citation, references
*** DONE add subtitles
    CLOSED: [2019-08-13 Tue 13:19]
*** DONE fix URLs points to other posts
    CLOSED: [2019-07-05 Fri 11:27]
*** DONE fix Arch post's images
    CLOSED: [2019-09-26 Thu 15:44]
*** double check Schnorr signature s = t - m*x?
*** DONE fix the fucking org-mode
    CLOSED: [2019-09-26 Thu 17:54]
*** add syntax highlight for older md files
*** DONE fix spelling in Surviging Bali, in-file navigation posts
*** DONE raw html in about page
*** DONE fix tag links
*** finite fields props: https://www.doc.ic.ac.uk/~mrh/330tutor/ch04.html, CAIN props, Abel :)
*** N/A snippets colors
*** code snippets, line numbers
*** zero-knowledge proofs tag
*** replace old md with org files
** Tasks
*** DONE Wakatime reports=B$9
    CLOSED: [2019-03-14 Thu] SCHEDULED: <2019-03-14 Thu>
*** Runkeeper reports
*** DONE add comments
    CLOSED: [2019-05-02 Thu 10:03]
    :LOGBOOK:
    CLOCK: [2019-05-02 Thu 09:30]--[2019-05-02 Thu 10:02] =>  0:32
    :END:
*** DONE migrate blog to Hugo+Gitlab
    CLOSED: [2019-04-19 Fri 13:41]
   :LOGBOOK:
   CLOCK: [2019-04-19 Fri 09:50]--[2019-04-19 Fri 13:41] =>  3:51
   CLOCK: [2019-04-18 Thu 16:07]--[2019-04-18 Thu 17:34] =>  1:27
   :END:
*** DONE add SSL: [[https://gitlab.com/help/user/project/pages/lets_encrypt_for_gitlab_pages.md][tutorial]]
    CLOSED: [2019-04-20 Sat 12:03]
*** N/A use Sage interpreter in Hugo
*** DONE add Google analytics
    CLOSED: [2019-02-28 Thu] SCHEDULED: <2019-02-28 Thu>
*** DONE menu sections
    CLOSED: [2019-07-05 Fri 11:20]
*** new theme
    examples:
    - https://themes.gohugo.io//theme/cupper-hugo-theme/post/
    - https://themes.gohugo.io//theme/vanilla-bootstrap-hugo-theme/tags/
    - https://themes.gohugo.io//theme/hugo-bootstrap/
    - https://themes.gohugo.io//theme/minimal/post/
    - https://themes.gohugo.io//theme/hugo-now//
    - https://themes.gohugo.io//theme/minimo/
    requirements:
    - [ ] disqus
    - [ ] google analytics
    - [ ] tags
    - [ ] categories
    - [ ] social links
*** use relative URLs to other posts
*** DONE Renew Lets Encrypt SSL certificate
    :PROPERTIES:
    :LAST_REPEAT: [2020-01-06 Mon 16:28]
    :END:
    - State "DONE"       from "TODO"       [2020-01-06 Mon 16:28]
    - State "DONE"       from "TODO"       [2019-10-03 Thu 13:36]
    - State "DONE"       from "TODO"       [2019-07-05 Fri 13:17]
    https://gitlab.com/help/user/project/pages/lets_encrypt_for_gitlab_pages.md
** TODO Write new blog post
    SCHEDULED: <2020-11-06 Fri +2w>
    :PROPERTIES:
    :LAST_REPEAT: [2020-10-30 Fri 08:45]
    :END:
    - State "DONE"       from "TODO"       [2020-10-30 Fri 08:45]
    - State "DONE"       from "TODO"       [2020-10-10 Sat 07:10]
    - State "DONE"       from "TODO"       [2020-09-29 Tue 16:00]
    - State "DONE"       from "TODO"       [2020-09-18 Fri 10:46]
    - State "DONE"       from "TODO"       [2020-08-31 Mon 23:09]
    - State "DONE"       from "TODO"       [2020-08-13 Thu 14:01]
    - State "DONE"       from "TODO"       [2020-07-30 Thu 18:30]
    - State "DONE"       from "TODO"       [2020-07-19 Sun 12:46]
    - State "DONE"       from "TODO"       [2020-06-24 Wed 13:51]
    - State "DONE"       from "TODO"       [2020-06-09 Tue 11:27]
    - State "DONE"       from "TODO"       [2020-05-25 Mon 20:03]
    - State "DONE"       from "TODO"       [2020-05-07 Thu 12:47]
    - State "DONE"       from "TODO"       [2020-04-30 Thu 17:52]
    - State "DONE"       from "TODO"       [2020-04-09 Thu 15:41]
    - State "DONE"       from "TODO"       [2020-03-26 Thu 17:52]
    - State "DONE"       from "TODO"       [2020-03-10 Tue 16:23]
    - State "DONE"       from "TODO"       [2020-02-27 Thu 17:34]
    - State "DONE"       from "TODO"       [2020-02-12 Wed 15:32]
    - State "DONE"       from "TODO"       [2020-01-21 Tue 17:46]
    - State "DONE"       from "TODO"       [2020-01-07 Tue 15:41]
    - [X] cryptography
    - [ ] emacs
